Documents/упЗаявкаНаТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упЗаявкаНаТС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.упСтатусыЗаявокНаТС</xr:Item>
				<xr:Item>InformationRegister.упСтатусыРейсов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БеречьОтВлаги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БеречьОтИзлучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БеречьОтНагрева</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрещеноСкладироватьДругНаДруга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассОпасности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКлассыОпасности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗагрузочныхМетров</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗагрузочныхМетров</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоМест</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПеревозчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяВысота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяДлина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяШирина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Масса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоРейса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Объем</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеРейса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОценочнаяСтоимость</Name>
					<Comment>Оценочная стоимость груза</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоПодбораПеревозчиков</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПравилаПодбораПеревозчиковНаРейсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСоглашенияСПеревозчиками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасходы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасходыНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемпературныйРежим</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТемпературныеРежимы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тендер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хрупкий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЧасовыеПояса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЭтапПодбораПеревозчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПлановыеРасходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравилоРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упПравилаРаспределенияРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.упЗаданиеНаПеревозкуГруза</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоОпераций</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/упПредложениеПеревозчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упПредложениеПеревозчика</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.упСтатусыЗаявокНаТС</xr:Item>
				<xr:Item>InformationRegister.упПредложенияПеревозчика</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПодачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаТС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПеревозчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСоглашенияСПеревозчиками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасходы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасходыНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЧасовыеПояса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПлановыеРасходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравилоРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упПравилаРаспределенияРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.упЗаданиеНаПеревозкуГруза</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоОпераций</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

WebServices/tmsGetCarrierResponse/Ext/Module.bsl
#Область ЗагрузкаСправочников
// Нет.
#КонецОбласти 

#Область ЗагрузкаДокументов
// Нет.
#КонецОбласти 

#Область ЗагрузкаЗаписейРегистров

// Нет.

#КонецОбласти 

#Область ВспомогательныеФункцииИПроцедуры

Функция GetCarrierResponse(CarrierResponse)
	
	текРезультат 		= Истина; 	 
		
	текПредложениеПеревозчикаXDTO	= CarrierResponse;
	
	Если ТипЗнч(текПредложениеПеревозчикаXDTO) = Тип("ОбъектXDTO") Тогда
				
		текЗаявкаНаТСУИД	= текПредложениеПеревозчикаXDTO.Получить("RequestUID");
		текПеревозчикУИД	= текПредложениеПеревозчикаXDTO.Получить("CarrierUID");
		текСоглашениеУИД	= текПредложениеПеревозчикаXDTO.Получить("AgreementUID");
		текТипТСУИД			= текПредложениеПеревозчикаXDTO.Получить("TypeVehicleUID");
		текТранспортноеСредствоУИД	= текПредложениеПеревозчикаXDTO.Получить("VehicleUID");
		текВремяПодачи		= текПредложениеПеревозчикаXDTO.Получить("BeginTime");
		текВремяЗавершения	= текПредложениеПеревозчикаXDTO.Получить("EndTime");
		текВодитель1УИД		= текПредложениеПеревозчикаXDTO.Получить("Driver1UID");
		текВодитель2УИД		= текПредложениеПеревозчикаXDTO.Получить("Driver2UID");
		текЭкспедиторУИД	= текПредложениеПеревозчикаXDTO.Получить("ForwarderUID");
		текВалютаУИД		= текПредложениеПеревозчикаXDTO.Получить("CurrencyUID");
		
		Если ПолучитьФункциональнуюОпцию("упВедетсяВалютныйУчет") Тогда
			текВалюта		= Справочники.Валюты.ПолучитьСсылку(Новый УникальныйИдентификатор(текВалютаУИД));
		Иначе
			текВалюта 		= Справочники.Валюты.ПустаяСсылка();
		КонецЕсли;	
		текЗаявкаНаТС		= Документы.упЗаявкаНаТС.ПолучитьСсылку(Новый УникальныйИдентификатор(текЗаявкаНаТСУИД));
		текПеревозчик		= Справочники.упПартнеры.ПолучитьСсылку(Новый УникальныйИдентификатор(текПеревозчикУИД));
		текСоглашение	    = Справочники.упСоглашенияСПеревозчиками.ПолучитьСсылку(Новый УникальныйИдентификатор(текСоглашениеУИД));
		текТипТС			= Справочники.упТипыТС.ПолучитьСсылку(Новый УникальныйИдентификатор(текТипТСУИД));
				
		Если НЕ текВодитель1УИД = Неопределено И ЗначениеЗаполнено(текВодитель1УИД) Тогда
			текВодитель1	= Справочники.упСотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор(текВодитель1УИД));
		Иначе
			текВодитель1	= Справочники.упСотрудники.ПустаяСсылка();
		КонецЕсли;
		
		Если НЕ текВодитель2УИД = Неопределено И ЗначениеЗаполнено(текВодитель2УИД) Тогда
			текВодитель2	= Справочники.упСотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор(текВодитель2УИД));
		Иначе
			текВодитель2	= Справочники.упСотрудники.ПустаяСсылка();
		КонецЕсли;

		Если НЕ текЭкспедиторУИД = Неопределено И ЗначениеЗаполнено(текЭкспедиторУИД) Тогда
			текЭкспедитор	= Справочники.упСотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор(текЭкспедиторУИД));
		Иначе	
			текЭкспедитор	= Справочники.упСотрудники.ПустаяСсылка();
		КонецЕсли;
		
		Если НЕ текТранспортноеСредствоУИД = Неопределено И ЗначениеЗаполнено(текТранспортноеСредствоУИД) Тогда
			текТранспортноеСредство	= Справочники.упТранспортныеСредства.ПолучитьСсылку(Новый УникальныйИдентификатор(текТранспортноеСредствоУИД));
		Иначе	
			текТранспортноеСредство	= Справочники.упТранспортныеСредства.ПустаяСсылка();
		КонецЕсли;
				
		текЗапрос = Новый Запрос;
		текЗапрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	упЗаявкаНаТС.Ссылка,
		|	упЗаявкаНаТС.ЧасовойПояс
		|ИЗ
		|	Документ.упЗаявкаНаТС КАК упЗаявкаНаТС
		|ГДЕ
		|	упЗаявкаНаТС.Ссылка = &ЗаявкаНаТС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	упПартнеры.Ссылка
		|ИЗ
		|	Справочник.упПартнеры КАК упПартнеры
		|ГДЕ
		|	упПартнеры.Ссылка = &Перевозчик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	упСоглашенияСПеревозчиками.Ссылка
		|ИЗ
		|	Справочник.упСоглашенияСПеревозчиками КАК упСоглашенияСПеревозчиками
		|ГДЕ
		|	упСоглашенияСПеревозчиками.Ссылка = &Соглашение
		|	И упСоглашенияСПеревозчиками.Владелец = &Перевозчик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	упТипыТС.Ссылка
		|ИЗ
		|	Справочник.упТипыТС КАК упТипыТС
		|ГДЕ
		|	упТипыТС.Ссылка = &ТипТС";
	
		
		текЗапрос.УстановитьПараметр("ЗаявкаНаТС", 	текЗаявкаНаТС);
		текЗапрос.УстановитьПараметр("Перевозчик", 	текПеревозчик);
		текЗапрос.УстановитьПараметр("Соглашение", 	текСоглашение);
		текЗапрос.УстановитьПараметр("ТипТС", 		текТипТС);
		
		
		мсвРезультат	= текЗапрос.ВыполнитьПакет();
			
		// Заявка на ТС
		текВыборка = мсвРезультат[0].Выбрать();
		ЧасовойПоясЗаявкиНаТС = Справочники.упЧасовыеПояса.ПустаяСсылка();
		Если НЕ текВыборка.Следующий() Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось найти заявку  на транспортное средство с идентификатором ""%1""'"), текЗаявкаНаТСУИД);
			ЗаписьЖурналаРегистрации("GetCarrierResponse", УровеньЖурналаРегистрации.Предупреждение, Метаданные.WebСервисы.tmsGetCarrierResponse,,ТекстОшибки);
			текРезультат = Ложь;
		Иначе
			ЧасовойПоясЗаявкиНаТС = текВыборка.ЧасовойПояс;
		КонецЕсли;
		
		// Перевозчик
		текВыборка = мсвРезультат[1].Выбрать();
		Если НЕ текВыборка.Следующий() Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось найти перевозчика с идентификатором ""%1""'"), текПеревозчикУИД);
			ЗаписьЖурналаРегистрации("GetCarrierResponse", УровеньЖурналаРегистрации.Предупреждение, Метаданные.WebСервисы.tmsGetCarrierResponse,,ТекстОшибки);
			текРезультат = Ложь;
		КонецЕсли;
		
		// Соглашение
		текВыборка = мсвРезультат[2].Выбрать();
		Если НЕ текВыборка.Следующий() Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось найти соглашение с идентификатором ""%1""'"), текСоглашениеУИД);
			ЗаписьЖурналаРегистрации("GetCarrierResponse", УровеньЖурналаРегистрации.Предупреждение, Метаданные.WebСервисы.tmsGetCarrierResponse,,ТекстОшибки);
			текРезультат = Ложь;
		КонецЕсли;
				
		// ТипТС
		текВыборка = мсвРезультат[3].Выбрать();
		Если НЕ текВыборка.Следующий() Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось найти тип транспортного средства с идентификатором ""%1""'"), текТипТСУИД);
			ЗаписьЖурналаРегистрации("GetCarrierResponse", УровеньЖурналаРегистрации.Предупреждение, Метаданные.WebСервисы.tmsGetCarrierResponse,,ТекстОшибки);
			текРезультат = Ложь;
		КонецЕсли;
				
		// Транспортное средство
		Если ЗначениеЗаполнено(текТранспортноеСредство) Тогда
			текЗапрос = Новый Запрос;
			текЗапрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			                  |	упТранспортныеСредства.Ссылка
			                  |ИЗ
			                  |	Справочник.упТранспортныеСредства КАК упТранспортныеСредства
			                  |ГДЕ
			                  |	упТранспортныеСредства.Ссылка = &Ссылка";
			текЗапрос.УстановитьПараметр("Ссылка", 	текТранспортноеСредство);
			текВыборка = текЗапрос.Выполнить().Выбрать();
			Если НЕ текВыборка.Следующий() Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось найти транспортное средство с идентификатором ""%1""'"), текТранспортноеСредствоУИД);
				ЗаписьЖурналаРегистрации("GetCarrierResponse", УровеньЖурналаРегистрации.Предупреждение, Метаданные.WebСервисы.tmsGetCarrierResponse,,ТекстОшибки);
				текРезультат = Ложь;
			КонецЕсли;
		КонецЕсли;

				
		// Водитель 1
		Если ЗначениеЗаполнено(текВодитель1) Тогда
			текЗапрос = Новый Запрос;
			текЗапрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			                  |	упСотрудники.Ссылка
			                  |ИЗ
			                  |	Справочник.упСотрудники КАК упСотрудники
			                  |ГДЕ
			                  |	упСотрудники.Ссылка = &Сотрудник";
			текЗапрос.УстановитьПараметр("Сотрудник", 	текВодитель1);
			текВыборка = текЗапрос.Выполнить().Выбрать();
			Если НЕ текВыборка.Следующий() Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось найти водителя1 с идентификатором ""%1""'"), текВодитель1УИД);
				ЗаписьЖурналаРегистрации("GetCarrierResponse", УровеньЖурналаРегистрации.Предупреждение, Метаданные.WebСервисы.tmsGetCarrierResponse,,ТекстОшибки);
				текРезультат = Ложь;
			КонецЕсли;
		КонецЕсли;

		// Водитель 2
		Если ЗначениеЗаполнено(текВодитель2) Тогда
			текЗапрос = Новый Запрос;
			текЗапрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			                  |	упСотрудники.Ссылка
			                  |ИЗ
			                  |	Справочник.упСотрудники КАК упСотрудники
			                  |ГДЕ
			                  |	упСотрудники.Ссылка = &Сотрудник";
			текЗапрос.УстановитьПараметр("Сотрудник", 	текВодитель2);
			текВыборка = текЗапрос.Выполнить().Выбрать();
			Если НЕ текВыборка.Следующий() Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось найти водителя2 с идентификатором ""%1""'"), текВодитель2УИД);
				ЗаписьЖурналаРегистрации("GetCarrierResponse", УровеньЖурналаРегистрации.Предупреждение, Метаданные.WebСервисы.tmsGetCarrierResponse,,ТекстОшибки);
				текРезультат = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		// Экспедитор
		Если ЗначениеЗаполнено(текЭкспедитор) Тогда
			текЗапрос = Новый Запрос;
			текЗапрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			                  |	упСотрудники.Ссылка
			                  |ИЗ
			                  |	Справочник.упСотрудники КАК упСотрудники
			                  |ГДЕ
			                  |	упСотрудники.Ссылка = &Сотрудник";
			текЗапрос.УстановитьПараметр("Сотрудник", 	текЭкспедитор);
			текВыборка = текЗапрос.Выполнить().Выбрать();
			Если НЕ текВыборка.Следующий() Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось найти водителя2 с идентификатором ""%1""'"), текЭкспедиторУИД);
				ЗаписьЖурналаРегистрации("GetCarrierResponse", УровеньЖурналаРегистрации.Предупреждение, Метаданные.WebСервисы.tmsGetCarrierResponse,,ТекстОшибки);
				текРезультат = Ложь;
			КонецЕсли;
		КонецЕсли;
				
		// СтатьяРасходов
		
		текСписокСтатейРасходов = текПредложениеПеревозчикаXDTO.Costs;
		
		тбзСписокТоваров	= Новый ТаблицаЗначений;
		тбзСписокТоваров.Колонки.Добавить("СтатьяРасходов", 		Новый ОписаниеТипов("СправочникСсылка.упСтатьиДоходовРасходов"));
		тбзСписокТоваров.Колонки.Добавить("Сумма", 			Новый ОписаниеТипов("Число"));
		тбзСписокТоваров.Колонки.Добавить("СуммаУпрУчет", Новый ОписаниеТипов("Число"));
						
		Для й = 0 По текСписокСтатейРасходов.Количество() - 1  Цикл
			текСтрока	= текСписокСтатейРасходов.Получить(й);
			
			текСтатьяРасходовУИД	= текСтрока.CostUID;
			текСтатьяРасходов		= Справочники.упСтатьиДоходовРасходов.ПолучитьСсылку(Новый УникальныйИдентификатор(текСтатьяРасходовУИД));
			текСумма		= текСтрока.Sum;
			
			текЗапрос = Новый Запрос;
			текЗапрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			                  |	упСтатьиДоходовРасходов.Ссылка
			                  |ИЗ
			                  |	Справочник.упСтатьиДоходовРасходов КАК упСтатьиДоходовРасходов
			                  |ГДЕ
			                  |	упСтатьиДоходовРасходов.Ссылка = &Ссылка";
			текЗапрос.УстановитьПараметр("Ссылка", текСтатьяРасходов);
			текВыборка 		= текЗапрос.Выполнить().Выбрать();
			Если НЕ текВыборка.Следующий() Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось найти статью расходов с идентификатором ""%1""'"), текСтатьяРасходовУИД);
				ЗаписьЖурналаРегистрации("GetCarrierResponse", УровеньЖурналаРегистрации.Предупреждение, Метаданные.WebСервисы.tmsGetCarrierResponse,,ТекстОшибки);
				текРезультат = Ложь;
			Иначе
				текСтрокаСписка = тбзСписокТоваров.Добавить();
				текСтрокаСписка.СтатьяРасходов 	= текСтатьяРасходов;
				текСтрокаСписка.Сумма			= текСумма;
				Если ПолучитьФункциональнуюОпцию("упВедетсяВалютныйУчет") Тогда
					текСтрокаСписка.СуммаУпрУчет 	= упСервисныеФункцииВызовСервера.РассчитатьСуммуУпр(текВалюта, текСтрокаСписка.Сумма) ;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если текРезультат Тогда
			
			текПредложениеДляПеревозчика			= Документы.упПредложениеПеревозчика.СоздатьДокумент();
			текПредложениеДляПеревозчика.Дата		= ТекущаяДата();
			текПредложениеДляПеревозчика.ЗаявкаНаТС	= текЗаявкаНаТС;
			текПредложениеДляПеревозчика.Перевозчик	= текПеревозчик;
			текПредложениеДляПеревозчика.Соглашение	= текСоглашение;
			текПредложениеДляПеревозчика.ТипТС		= текТипТС;
			текПредложениеДляПеревозчика.ВремяПодачи= текВремяПодачи;
			текПредложениеДляПеревозчика.Валюта		= текВалюта;
			текПредложениеДляПеревозчика.ВремяЗавершения = текВремяЗавершения; 
			
			текПредложениеДляПеревозчика.ТранспортноеСредство	= текТранспортноеСредство;
			
			текПредложениеДляПеревозчика.Водитель1		= текВодитель1;
			текПредложениеДляПеревозчика.Водитель2		= текВодитель2;
			текПредложениеДляПеревозчика.Экспедитор		= текЭкспедитор;
			
			Если ПолучитьФункциональнуюОпцию("упВедетсяРаботаВРазныхЧасовыхПоясах") Тогда
				текПредложениеДляПеревозчика.ЧасовойПояс = ЧасовойПоясЗаявкиНаТС;	
			КонецЕсли;  
		
			текПредложениеДляПеревозчика.ПлановыеРасходы.Загрузить(тбзСписокТоваров);
			
			Попытка
				текПредложениеДляПеревозчика.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Отказ = Истина;
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда 
					ТекстОшибки = ОписаниеОшибки();
				КонецЕсли;
				ЗаписьЖурналаРегистрации("Запись", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.упПредложениеПеревозчика,, ТекстОшибки);
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат текРезультат;
		
КонецФункции

#КонецОбласти
